import java.util.ArrayList;
import java.util.Arrays;
import java.util.List;

public class Warehouse {
    private List<ProductsGroup> groups = new ArrayList<>();

    /*
    дефолтні групи товарів: художня література, психологія та бізнес. кожна група товарів містить назву та опис.
    кожна книга має назву, автора, опис, видавництво, кількість на складі, ціну за одиницю.
     */
    ProductsGroup defaultGroup1 = new ProductsGroup(
            "Художня література",
            "якийсь опис",
            Arrays.asList(
                    new Product("1984",
                            "Джордж Орвелл",
                            "Роман описує життя людей в тоталітарному суспільстві, де всі аспекти життя контролюються державою, " +
                                    "яка перетворюється на абсолютну тиранію. Головний герой роману, Вінстон Сміт, працює у Міністерстві правди, " +
                                    "де він займається переписуванням історії, щоб узгодити її з поточними потребами режиму. " +
                                    "Автор наголошує на тому, як потужна держава може контролювати не тільки думки та дії людей, " +
                                    "але й саме поняття правди та історії.",
                            "Видавництво Жупанського",
                            25,
                            180),

                    new Product("Записки українського самашедшого",
                            "Ліна Костенко",
                            "Роман написано від імені 35-річного комп’ютерного програміста, який на тлі особистої драми прискіпливо," +
                                    " глибоко й болісно сканує усі вивихи нашого глобалізованого часу. " +
                                    "У світі надмірної (дез)інформації і тотального відчуження він – заручник світових абсурдів – " +
                                    "прагне подолати комунікативну прірву між чоловіком і жінкою, між родиною і професією, між Україною і світом. " +
                                    "За жанровою стилістикою «Записки українського самашедшого» – насичений мікс художньої літератури, " +
                                    "внутрішніх щоденників, сучасного літописання й публіцистики.",
                            "А-ба-ба-га-ла-ма-га",
                            20,
                            320),

                    new Product("Кульбабове вино",
                            "Рей Бредбері",
                            "Літо у неіснуючому містечку Ґрін Таун 1928 року… Веселі пустощі чотирьох безтурботних хлопчаків… " +
                                    "І кульбабове вино, яке готує дідусь… Воно – як чарівна капсула часу, що вбирає у себе досвід минулих літ, " +
                                    "воно – як ностальгія за дитинством, у яке зможе хоча б на мить повернутися кожен, " +
                                    "хто візьме до рук фантастичну повість Рея Бредбері «Кульбабове вино». " +
                                    "Ця книга – острівець, на якому зупиняється час. Її сторінки дихають далекими " +
                                    "дитинно-безмежними спогадами – теплими, п’янкими, вічними, проте яких нам не спіймати ніколи.",
                            "Навчальна книга - Богдан",
                            17,
                            125)
            )
    );

    ProductsGroup defaultGroup2 = new ProductsGroup(
            "Психологія",
            "якийсь опис",
            Arrays.asList(
                    new Product("Стань сильнішим",
                            "Брене Браун",
                            "Це книга психолога та письменниці Брене Браун, яка досліджує тему вразливості та сили. " +
                                    "Вона пропонує читачеві розглянути зв'язок між цими двома концепціями та доводить, " +
                                    "що справжня сила полягає в тому, щоб відкрито висловлювати свої емоції та бути вразливим. " +
                                    "Автор використовує власні дослідження та приклади з життя, щоб допомогти читачам зрозуміти, " +
                                    "як можна використовувати вразливість, щоб стати сильнішим. " +
                                    "Книга популярна серед тих, хто бажає зробити крок у своєму розвитку та почати рухатися до своїх мрій.",
                            "Книжковий клуб \"Клуб Сімейного Дозвілля\"",
                            18,
                            155),

                    new Product("Усе замахало. Але надія є",
                            "Марк Менсон",
                            "\"Усе замахало. Але надія є\" - це книга відомого письменника та блогера Марка Менсона, " +
                                    "яка присвячена темі труднощів та життєвої надії. У книзі автор досліджує, " +
                                    "які проблеми виникають в сучасному світі, від токсичної культури до політичної нестабільності, " +
                                    "та пропонує способи, якими люди можуть знайти надію та духовне задоволення в незвичайних місцях. " +
                                    "Менсон використовує свій саркастичний стиль написання та гумор, " +
                                    "щоб зробити ці теми доступними та зрозумілими для широкої аудиторії. " +
                                    "Книга є важливим ресурсом для тих, хто шукає підтримку та натхнення у складних життєвих ситуаціях.",
                            "Наш Формат",
                            14,
                            290),

                    new Product("Як здобувати друзів і впливати на людей",
                            "Дейл Карнегі",
                            "Книга містить практичні поради та приклади про те, як змінити своє ставлення до людей " +
                                    "та знайти спільну мову з ними, навіть якщо вони зовсім різні від нас. " +
                                    "Автор показує, що здатність впливати на інших людей є важливою складовою успіху " +
                                    "в будь-якій сфері життя, від бізнесу до особистих відносин. " +
                                    "Книга стала класикою жанру та досі залишається популярною в усьому світі, " +
                                    "допомагаючи людям розуміти, як взаємодіяти з іншими людьми та досягати своїх цілей.",
                            "КМ-БУКС",
                            35,
                            135)

            )
    );
    ProductsGroup defaultGroup3 = new ProductsGroup(
            "Бізнес",
            "якийсь опис",
            Arrays.asList(
                    new Product("7 звичок надзвичайно ефективних людей",
                            "Стівен Кові",
                            "Ця книжка — світовий супербестселер, праця №1 у темі росту особистості! " +
                                    "Вона позитивно вплинула на життя мільйонів людей в усьому світі, серед яких Білл Клінтон, Ларрі Кінг, Стівен Форбс!" +
                                    "Керівництво навчить вас краще розуміти себе, визначати пріоритети, формулювати життєві цілі й досягати їх. " +
                                    "Це книжка для тих, хто хоче стати кращим у професійній діяльності, " +
                                    "максимально реалізувати свій творчий потенціал та назавжди змінити своє життя на краще.",
                            "Книжковий клуб \"Клуб Сімейного Дозвілля\"",
                            50,
                            265),

                    new Product("Мистецтво говорити. Таємниці ефективного спілкування",
                            "Джеймс Борг",
                            "Бізнес-тренер Джеймс Борґ, відомий своїми відкриттями в галузях спілкування, особистісного розвитку, " +
                                    "мови тіла та «контролю мислення», пропонує прості і дієві поради для кожної людини. " +
                                    "Його методика допоможе змінити спосіб мислення і поведінку в особистому житті й на роботі, " +
                                    "зробить життя цікавішим, насиченішим і позбавить зайвого стресу, " +
                                    "а ваші навички спілкування сягнуть геть нового рівня.",
                            "Фабула",
                            40,
                            265),

                    new Product("Думай і багатій",
                            "Наполеон Гілл",
                            "Коли Наполеон Гілл був ще зовсім юним, Дейл Карнегі розважливо поділився з ним таємною формулу успіху, " +
                                    "яку він вивів ґрунтуючись на досягненнях видатних людей. Відтоді Наполеон Гілл не тільки зумів багато " +
                                    "чого досягти в бізнесі та особистому житті, а й дав можливість всьому світу випробувати цю формулу на особистому досвіді. " +
                                    "Може здатися, що «Думай і багатій» обіцяє надто багато, але прочитавши та зрозумівши ту саму формулу успіху, " +
                                    "ви усвідомите, що вона дала вам набагато більше, ніж ви могли собі уявити. На відміну від більшості сучасних видань, " +
                                    "що пропонують готові рішення проблем, Наполеон Гілл дає дещо більше — він дає Ідею, " +
                                    "яка застосовується для всіх аспектів життя.",
                            "Книжковий клуб \"Клуб Сімейного Дозвілля\"",
                            37,
                            230)
            )
    );



    public Warehouse() {
        groups.add(defaultGroup1);
        groups.add(defaultGroup2);
        groups.add(defaultGroup3);
    }
}



