import java.util.Arrays;

public class Warehouse {
    public Warehouse() {
        ProductsGroup defaultGroup1 = new ProductsGroup (
                "Художня література",
                "якийсь опис",
                Arrays.asList(
                        new Product("1984",
                                "Джордж Орвелл",
                                "Роман описує життя людей в тоталітарному суспільстві, де всі аспекти життя контролюються державою, " +
                                        "яка перетворюється на абсолютну тиранію. Головний герой роману, Вінстон Сміт, працює у Міністерстві правди, " +
                                        "де він займається переписуванням історії, щоб узгодити її з поточними потребами режиму. " +
                                        "Автор наголошує на тому, як потужна держава може контролювати не тільки думки та дії людей, " +
                                        "але й саме поняття правди та історії.",
                                "Видавництво Жупанського",
                                15,
                                180)
                )
        );
    }
}
